SET NAMES UTF8;
DROP DATABASE IF EXISTS flower;
CREATE DATABASE flower CHARSET=UTF8;
USE flower;
CREATE TABLE flower_user(
  id INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(50),
  upwd  VARCHAR(32),
  phone CHAR(11)
);
INSERT INTO flower_user VALUES(null,'tom',md5('123'),18810001234);
INSERT INTO flower_user VALUES(null,'jerry',md5('123'),18810001234);


CREATE TABLE flower_dizhi(
  id INT PRIMARY KEY AUTO_INCREMENT,
  fid INT,
  dzhi  VARCHAR(100),
  FOREIGN KEY(fid) REFERENCES flower_user(id)
);
INSERT INTO flower_dizhi VALUES(null,1,'北京市,丰台区，开阳里七区，1号楼1单元101室');
INSERT INTO flower_dizhi VALUES(null,1,'北京市,东城区，西革新里，2号楼2单元202室');


CREATE TABLE flower_cart(
  id INT PRIMARY KEY AUTO_INCREMENT,
  img_url VARCHAR(25),
  price   DECIMAL(10,2),
  title   VARCHAR(255),
  count   INT,
  uid     INT
);
INSERT INTO flower_cart VALUES(null,'i1.png','139.00',"恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配",1,1)


CREATE TABLE flower_product(
  id INT PRIMARY KEY AUTO_INCREMENT,
  img_url VARCHAR(50),
  title VARCHAR(10),
  price  VARCHAR(32),
  class  VARCHAR(10),
  title_1 VARCHAR(50),
  flower_content_1 VARCHAR(500),
  flower_content_2 VARCHAR(500),
  flower_content_3 VARCHAR(500),
  flower_content_4 VARCHAR(500),
  img_1 VARCHAR(50),
  img_2 VARCHAR(50),
  img_3 VARCHAR(50),
  img_4 VARCHAR(50),
  img_5 VARCHAR(50),
  img_6 VARCHAR(50),
  img_7 VARCHAR(50)
);
INSERT INTO flower_product VALUES(null,'i1.png',"恋你久久","139.00","爱情鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i2.png',"甜美公主","219.00","爱情鲜花","甜美公主--19枝戴安娜粉玫瑰、栀子叶、黄英、白色相思梅搭配","再多一点点距离，我就能靠近你。清晰甜美的空气里，爱你到不能呼吸","19枝戴安娜粉玫瑰、栀子叶、黄英、白色相思梅搭配","紫色双面欧雅纸包装","下单填写留言，即免费赠送精美贺卡！",'2-1.jpg','2-2.jpg','2-3.jpg','2-4.jpg','2-5.jpg','2-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i3.png',"今生挚爱","219.00","爱情鲜花","今生至爱--红玫瑰19枝，白色相思梅0.5扎，栀子叶1扎","爱你是一种幸福，疼你是一种珍惜，看你是一种享受，吻你是一种温柔，抱你是一种浪漫，念你是一种习惯，想你是一种快乐，等你是一种考验。只想告诉你","红玫瑰19枝，白色相思梅0.5扎，栀子叶1扎","深灰色opp雾面纸2张，酒红色宽缎带1.5米","下单填写留言，即免费赠送精美贺卡！",'3-1.jpg','3-2.jpg','3-3.jpg','3-4.jpg','3-5.jpg','3-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i4.png',"恰似你的温柔","159.00","爱情鲜花","恰似你的温柔--11朵香槟玫瑰，叶上花搭配","你的温柔似水，静静无言，用心浇灌一份爱，等待最美的时刻绽放。",
"11朵香槟玫瑰，叶上花搭配","淡紫色韩式包扎","下单填写留言，即免费赠送精美贺卡！",'4-1.jpg','4-2.jpg','4-3.jpg','4-4.jpg','4-5.jpg','4-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i5.png',"慢慢喜欢你","299.00","爱情鲜花","慢慢喜欢你--红玫瑰33支，石竹梅外围点缀","突然一个清秀的女孩映入眼帘，我喜欢这一种特别的幸福感觉","红玫瑰33支，石竹梅外围点缀","白色棉纸内包，黑色包装纸外围圆形包装，红色丝带蝴蝶结","下单填写留言，即免费赠送精美贺卡！",'5-1.jpg','5-2.jpg','5-3.jpg','5-4.jpg','5-5.jpg','5-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i6.png',"邂逅的公主","319.00","爱情鲜花","邂逅的公主--粉玫瑰33支，相思梅搭配","与你相伴，日子里充斥着甜甜的味道，与你相恋，生活里填满了幸福的滋味，与你相守，人生里塞满了快乐的气息，亲爱的，有你的日子，每一天都是幸福，我爱你！","粉玫瑰33支，相思梅搭配","粉色包装纸圆形外包，粉色蝴蝶结系扎","下单填写留言，即免费赠送精美贺卡！",'6-1.jpg','6-2.jpg','6-3.jpg','6-4.jpg','6-5.jpg','6-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i7.png',"给你我的心","319.00","爱情鲜花","给你我的心--33支红玫瑰，洋桔梗外围一圈","有一种情穿越千年而亘古不变，化作春风般的温暖，开出美丽的花朵，变成专属信使，告诉你：亲爱的，很想你！","33支红玫瑰，洋桔梗外围一圈","高级雾面纸圆形包扎，丝带蝴蝶结","下单填写留言，即免费赠送精美贺卡！",'7-1.jpg','7-2.jpg','7-3.jpg','7-4.jpg','7-5.jpg','7-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i8.png',"执子之手","599.00","爱情鲜花","执子之手--99支精品玫瑰（粉玫瑰和红玫瑰），满天星外围搭配","一辈子是段太长太远的时光，执子之手，与子偕老的一辈子，相濡以沫，不离不弃的一辈子","99支精品玫瑰（粉玫瑰和红玫瑰），满天星外围搭配","粉色雾面纸圆形包扎，中间粉玫瑰桃心造型，丝带蝴蝶结","下单填写留言，即免费赠送精美贺卡！",'8-1.jpg','8-2.jpg','8-3.jpg','8-4.jpg','8-5.jpg','8-6.jpg','1-7.jpg');




INSERT INTO flower_product VALUES(null,'i9.png',"喜欢你","169.00","生日鲜花","情话微甜--11枝红玫瑰，黄莺，红豆搭配","风是透明的，雨是滴答的，云是流动的，歌是自由的，爱是用心的，恋是疯狂的，天是永恒的，你是我的。","11枝红玫瑰，黄莺，红豆搭配","黑色礼盒","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i10.png',"海洋之恋","199.00","生日鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i11.png',"稳稳的幸福","189.00","生日鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i12.png',"如花似玉","189.00","生日鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i13.png',"爱的呼唤","219.00","生日鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i14.png',"玫瑰仙子","259.00","生日鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i15.png',"暖暖的爱恋","229.00","生日鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i16.png',"甜蜜蜜","329.00","生日鲜花","恋你久久--红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","红玫瑰9枝，粉色(或者紫色）勿忘我0.4扎，栀子叶适量搭配","内层白色雾面纸，外层牛皮纸,咖啡色花结","下单填写留言，即免费赠送精美贺卡！",'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg');



INSERT INTO flower_product VALUES(null,'i17.png',"情话微甜","179.00","精品礼盒","情话微甜--11枝红玫瑰，黄莺，红豆搭配","风是透明的，雨是滴答的，云是流动的，歌是自由的，爱是用心的，恋是疯狂的，天是永恒的，你是我的。","11枝红玫瑰，黄莺，红豆搭配","黑色礼盒","下单填写留言，即免费赠送精美贺卡！",'17-1.jpg','17-2.jpg','17-3.jpg','17-4.jpg','17-5.jpg','17-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i18.png',"含情脉脉","179.00","精品礼盒","含情脉脉--11枝戴安娜玫瑰，黄莺，相思梅搭配","一眼万年，没遇到你之前我不相信一见之情，遇到你之后，就此沦陷","11枝戴安娜玫瑰，黄莺，相思梅搭配","灰色礼盒","下单填写留言，即免费赠送精美贺卡！",'18-1.jpg','18-2.jpg','18-3.jpg','18-4.jpg','18-5.jpg','18-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i19.png',"红豆相思","229.00","精品礼盒","甜美的你--19支精品粉玫瑰，搭配适量尤加利","即使在千里之外，都会有风摇醒我的思念，融化我心，如花般嫣然","19支精品粉玫瑰，搭配适量尤加利","深蓝色精致礼盒包装","下单填写留言，即免费赠送精美贺卡！",'19-1.jpg','19-2.jpg','19-3.jpg','19-4.jpg','19-5.jpg','19-6.jpg','19-7.jpg');


INSERT INTO flower_product VALUES(null,'i20.png',"盼君归来","229.00","精品礼盒","盼君归来--香槟19枝，尤加利叶、满天星搭配","不顾风雨，不问世事，唯盼君归来","香槟19枝，尤加利叶、满天星搭配","礼盒装","下单填写留言，即免费赠送精美贺卡！",'17-1.jpg','17-2.jpg','17-3.jpg','17-4.jpg','17-5.jpg','17-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i21.png',"甜美的你","229.00","精品礼盒","甜美的你--19支精品粉玫瑰，搭配适量尤加利","即使在千里之外，都会有风摇醒我的思念，融化我心，如花般嫣然","19支精品粉玫瑰，搭配适量尤加利","深蓝色精致礼盒包装","下单填写留言，即免费赠送精美贺卡！",'17-1.jpg','17-2.jpg','17-3.jpg','17-4.jpg','17-5.jpg','17-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i22.png',"爱的小幸福","229.00","精品礼盒","爱的小确幸--戴安娜粉玫瑰21枝，粉色桔梗5枝，石竹梅7枝","一个人有一种幸福，爱是最简单的音符，啦啦啦~微小确定的幸福！","戴安娜粉玫瑰21枝，粉色桔梗5枝，石竹梅7枝","高档灰色包装盒","下单填写留言，即免费赠送精美贺卡！",'17-1.jpg','17-2.jpg','17-3.jpg','17-4.jpg','17-5.jpg','17-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i23.png',"每天更爱你","319.00","精品礼盒","每天更爱你--33支混色玫瑰拼成“LOVE”形状+2支可爱小熊（6支香槟玫瑰+10支红玫瑰+7支白玫瑰+10支粉玫瑰），搭配适量绿叶。","我对你的爱，永远比昨天多一点，比明天少一点。每天爱你多一些！","33支混色玫瑰拼成“LOVE”形状+2支可爱小熊（6支香槟玫瑰+10支红玫瑰+7支白玫瑰+10支粉玫瑰），搭配适量绿叶。","精美长方形礼盒装。","下单填写留言，即免费赠送精美贺卡！",'17-1.jpg','17-2.jpg','17-3.jpg','17-4.jpg','17-5.jpg','17-6.jpg','1-7.jpg');


INSERT INTO flower_product VALUES(null,'i24.png',"深情时刻","279.00","精品礼盒","深情时刻--11朵蓝色妖姬1支白色多头百合,黄莺搭配","梦到你的夜晚，享受香甜的睡眠，思念你的时刻，享受深情的香甜，回忆你的笑脸，开心溢出眼帘。","11朵蓝色妖姬1支白色多头百合,黄莺搭配","蓝色长方形礼盒如图精美包装","下单填写留言，即免费赠送精美贺卡！",'17-1.jpg','17-2.jpg','17-3.jpg','17-4.jpg','17-5.jpg','17-6.jpg','1-7.jpg');



INSERT INTO flower_product VALUES(null,'i25.png',"大红大紫(一对)","239.00","开业花篮","大红大紫(一对)--红色，粉色扶朗花,散尾叶丰满配花。","鞭炮轰来财运绕，花篮送来聚财宝，祝词带来福音到，贺宴迎来人气高；新店开业美不少，祝福声声喜来报，祝你财源滚滚至，生意兴隆万事好！","红色，粉色扶朗花,散尾叶丰满配花。","单层开业花篮","下单填写留言，即免费赠送精美贺卡！",'25-1.jpg','25-2.jpg',null,null,null,null,null);


INSERT INTO flower_product VALUES(null,'i26.png',"前程无量(一对)","279.00","开业花篮","前程无量(一对)--红色扶朗花、粉色香水百合3朵、巴西叶，散尾叶丰满配花。","幽香拂面，紫气兆祥，花篮簇拥，开业典礼，祝事业有大成，生意更长久，生意如春浓，财源似水来。","红色扶朗花、粉色香水百合3朵、巴西叶，散尾叶丰满配花","单层开业花篮","下单填写留言，即免费赠送精美贺卡！",'26-1.jpg','25-2.jpg',null,null,null,null,null);


INSERT INTO flower_product VALUES(null,'i27.png',"开业大吉(一对)","249.00","开业花篮","开业大吉（一对）--各色扶朗花、巴西叶，散尾叶丰满配花。","恭贺新店开张，送上我的祝贺，送你一个招财猫，愿你财源广进，送你一棵发财树，愿你财源茂盛，送你一尊大财神，保佑你财源滚滚。","各色扶朗花、巴西叶，散尾叶丰满配花。","单层开业花篮","下单填写留言，即免费赠送精美贺卡！",'27-1.jpg','25-2.jpg',null,null,null,null,null);


INSERT INTO flower_product VALUES(null,'i28.png',"吉祥如意(一对)","299.00","开业花篮","吉祥如意（一对）--红色，橘色扶朗花、3朵粉色香水百合、巴西叶，散尾叶丰满配花。","左迎招财猫，揽客来；右迎摇钱树，日进金；上接天地气，迎好运；中坐财神爷，保顺利！祝开业大吉大利，生意兴隆！","红色，橘色扶朗花、3朵粉色香水百合、巴西叶，散尾叶丰满配花。","单层开业花篮","下单填写留言，即免费赠送精美贺卡！",'28-1.jpg','25-2.jpg',null,null,null,null,null);


INSERT INTO flower_product VALUES(null,'i29.png',"生意红红火火(一对)","409.00","开业花篮","生意红红火火（一对）--扶朗，香水百合，富贵竹，散尾葵","财源滚滚而来，生意红红火火","扶朗，香水百合，富贵竹，散尾葵","双层花篮开业花篮","下单填写留言，即免费赠送精美贺卡！",'29-1.jpg','25-2.jpg',null,null,null,null,null);


INSERT INTO flower_product VALUES(null,'i30.png',"年年大发","199.00","开业花篮","年年大发--精选各色扶郎花，香槟6枝、百合花、散尾葵、绿叶搭配。","开张大吉，送上祝贺，祝你日进斗金，装满仓；月月盈利，数钱忙；年年大发，门庭旺。时时红火，分分兴旺，秒秒兴隆。","精选各色扶郎花，香槟6枝、百合花、散尾葵、绿叶搭配。","双层开业花篮（此价格为单个的价格）","下单填写留言，即免费赠送精美贺卡！",'30-1.jpg','25-2.jpg',null,null,null,null,null);


INSERT INTO flower_product VALUES(null,'i31.png',"财通四海","199.00","开业花篮","财通四海--玫瑰6枝，各色抚郎、百合、散尾葵搭配","听说你开业在即，我特意为你选个好日子：周一滚滚来钱财，周二福气纳进来，周三生意定兴隆，周四红火迎客来，周五宏图展大志，周六紫气东方在，周日幸福乐开怀！嘿嘿，不管你要哪一天，生意兴隆都会在！","玫瑰6枝，各色抚郎、百合、散尾葵搭配","1.8米双层花篮（此价格为单个的价格）","下单填写留言，即免费赠送精美贺卡！",'31-1.jpg','25-2.jpg',null,null,null,null,null);


INSERT INTO flower_product VALUES(null,'i32.png',"骏业崇隆","569.00","开业花篮","骏业崇隆--戴安娜粉玫瑰、白玫瑰、白百合、跳舞兰、天堂乌、洋桔梗、散尾叶、八角金盘搭配。","送花篮，财运环；送礼炮，好运伴；送红包，红火连；送好酒，顺连连；送祝福，兴隆欢；祝新店，开张吉，生意好，美不完！","戴安娜粉玫瑰、白玫瑰、白百合、跳舞兰、天堂乌、洋桔梗、散尾叶、八角金盘搭配。","三角架花篮（此价格为单个的价格）","下单填写留言，即免费赠送精美贺卡！",'32-1.jpg','25-2.jpg',null,null,null,null,null);


CREATE TABLE flower_language(
  id INT PRIMARY KEY AUTO_INCREMENT,
  img_url VARCHAR(50),
  title VARCHAR(20),
  class1  VARCHAR(10),
  content1 VARCHAR(200),
  img_url1 VARCHAR(50),
  content2 VARCHAR(200),
  content3 VARCHAR(200),
  content4 VARCHAR(200),
  content5 VARCHAR(200),
  content6 VARCHAR(200),
  img_url2 VARCHAR(50),
  content7 VARCHAR(200),
  content8 VARCHAR(200),
  content9 VARCHAR(200),
  content10 VARCHAR(200),
  content11 VARCHAR(200),
  img_url3 VARCHAR(50),
  content12 VARCHAR(200),
  content13 VARCHAR(200),
  content14 VARCHAR(200),
  content15 VARCHAR(200),
  content16 VARCHAR(200),
  img_url4 VARCHAR(50),
  content17 VARCHAR(200),
  content18 VARCHAR(200),
  content19 VARCHAR(200),
  content20 VARCHAR(200)
);

INSERT INTO flower_language VALUES(null,"hy01.png","朋友硕士毕业，应该送什么鲜花？","分类：毕业送花","六月的毕业季，总是带着丝丝的不舍。朋友也陆续硕士毕业了，若你准备祝福他，送上一束花给他，或许是很好的礼物哦！可是硕士毕业送什么花？下面一起来看看吧。",'hy01-01.png',"甜美的花季","鲜花花材：6支向日葵，桔梗，绣球，相思豆搭配。","鲜花包装：韩式包扎，精美蝴蝶结装饰","鲜花花语：这久违的感觉，那熟悉的气息。悠悠的，淡淡的，是那样的清甜，是那样的芳香。","若对方是女孩子，你送鲜花给她，一定是没有错的。女孩子一般情况下都比较喜欢鲜花，送给她的时候，可以选择这样的花束，配上一两句简洁祝贺的话语，表达你的心意就好了。","hy01-02.png","阳光向上","鲜花花材：8朵向日葵，红豆，绿叶搭配。","鲜花包装：白色包装纸包装，紫色带子系花。","鲜花花语：积极向上，阳光。","若对方是你的女朋友，那就送她玫瑰花，既能够表达你对她的爱意，也能够表示祝贺之意。通常是选红色的，当然别的颜色的也是可以选的，除非你女朋友要求说让你送别的花给她，不然就是送玫瑰花了，我就常送我女朋友玫瑰花，今年的情人节也是。","hy01-03.png","爱你不是两三天","鲜花花材：11支红玫瑰，红豆相思梅搭配。","鲜花包装：豆沙色包装纸精美包装，丝带系结。","鲜花花语：爱你不是两三天，而是一辈子一生一世。","要是收花人只是普通朋友，可以送百合花和向日葵，百合花和向日葵都有祝福之意，也是寓意吉祥的鲜花。向日葵更有寓意美好未来之意，用来送给朋友再合适不过，这些鲜花的款式都可以在花多彩鲜花网进行预订，而且可以鲜花速递上门。","hy01-04.png","海洋之恋","鲜花花材：9朵香槟玫瑰，2支百合，叶上花红豆搭配。","鲜花包装：雪梨纸内衬，藏青色高档包装。","鲜花花语：你喜欢大海，我爱你。");
INSERT INTO flower_language VALUES(null,'hy02.png',"33朵红玫瑰寓意什么？","分类：鲜花寓意","代表爱情的鲜花相信第一想到的就是玫瑰，而玫瑰中最常见用得最多的就是红玫瑰了，红玫瑰的花语代表着热烈的爱，而33朵玫瑰寓意着缘定三生和三生三世的爱情。送三十三朵红玫瑰更代表自己坚定不移的爱情。红玫瑰艳丽动人、热情大方，能给人带来一种吸引力。非常适合送给恋人或是表明自己的心意，花多彩鲜花网推荐以下几款33朵红玫瑰花束供您选择。","hy02-01.png","厮守","花材：33朵红玫瑰红石竹梅若干搭配。","包装：高级牛皮纸精致包装，牛皮纸蝴蝶结束花。","赠送：免费附送精美贺卡，代写您的祝福。","红玫瑰花束-甜蜜的爱恋","hy02-02.png","甜蜜的爱恋","花材：33支红玫瑰，搭配黄莺配花，蓝色包装纸，蓝色彩带。","花语：你的心是我到世界尽头都想去的地方，给我一个机会，给你甜蜜的爱恋。","赠送：免费附送精美贺卡，代写您的祝福。","红玫瑰礼盒-满载幸福","hy02-03.png","满载幸福","花材：33支顶级红玫瑰绿叶点缀 ","包装：咖啡色礼盒精致包装 ","赠送：免费附送精美贺卡，代写您的祝福。","红玫瑰花束-化为相思","hy02-04.png","化为相思","花材：33朵红玫瑰黄莺外围 ","包装：高级牛皮纸精致包装，蝴蝶结束扎 ","赠送：免费附送精美贺卡，代写您的祝福。");
INSERT INTO flower_language VALUES(null,'hy03.png',"9月20表白日适合送什么花？","分类：表白送花","920这天因为920又谐音着就爱你，所以在这一天表白是非常浪漫合适的。每一种鲜花都代表着独特的寓意，在表白节这一天用一束鲜花表达自己的感情也是非常特殊浪漫的。920表白送什么花？在这一天表白的时候可以选择送盒装的鲜花搭配巧克力。这样的盒装鲜花既方便携带同时还可以食用，而巧克力也有着自己独特的寓意。","hy03-01.png","圣诞情怀","花材：9朵红玫瑰,1个苹果,9个巧克力2只小熊。","包装：精美心型礼盒。","赠送：免费附送精美贺卡，代写您的祝福。","巧克力花盒-至爱至情","hy03-02.png","至爱至情","花材：11朵蓝妖,9个巧克力2只小熊。","包装：精美心型礼盒。","赠送：免费附送精美贺卡，代写您的祝福。","巧克力花盒-相依相爱","hy03-03.png","相依相爱","花材：9朵红玫瑰,9个巧克力 包装：精美心型礼盒。","包装：精美心型礼盒。","赠送：免费附送精美贺卡，代写您的祝福。","巧克力花盒-轻轻祝福","hy03-04.png","轻轻祝福","花材：11朵白玫瑰,11个巧克力2只小熊。","包装：精美心型礼盒。","赠送：免费附送精美贺卡，代写您的祝福。");
INSERT INTO flower_language VALUES(null,'hy04.png',"代表爱情的花都有哪些？","分类：","在特殊的日子想要对心里的意中人表达自己的一份感情，送一束鲜花绝对是最直接的方式之一。那么哪些花的花语代表着爱情。以下几种爱情鲜花可以用在不同的场合。桔梗花代表着真诚不变的爱，可以在约会或是生日的时候送。薰衣草代表着等待爱情，向日葵代表沉默的爱，这两种鲜花适合送给暗恋的人。而红色郁金香代表着热烈的爱，可以在纪念日的时候送给恋人，在纪念日的时候也可以送百合花，寓意百年好合，百事合意。","hy04-01.png","那年夏天","花材：10支白色洋桔梗勿忘我桉树叶搭配"," 包装：高级牛皮纸精致包装，绸带系花。","赠送：免费附送精美贺卡，代写您的祝福。","花束-想你在心里","hy04-02.png","想你在心里","花材：10支紫色洋桔梗 ","包装：高级牛皮纸精致包装，绸带系花。","赠送：免费附送精美贺卡，代写您的祝福。","花束-对你无尽的爱","hy04-03.png","对你无尽的爱","花材：19支深紫色郁金香."," 包装：白色包装纸精美包装，精致绸带系花。","赠送：免费附送精美贺卡，代写您的祝福。","花束-思念","hy04-04.png","思念","花材：20支粉色郁金香，绿叶搭配 ","包装：灰色手揉纸扇形精美包装，精致绸带系花。","赠送：免费附送精美贺卡，代写您的祝福。");
INSERT INTO flower_language VALUES(null,'hy05.png',"买一盒永生花要多少钱？","分类：花卉选购","当送恋人花的时候，相信很多女性都是非常喜欢永生花的。永生花既比鲜花的保存时间更长又比其他鲜花独具特殊寓意，所以送上一盒永生花也是非常好的选择。","hy05-01.png","唯一的色彩","花材：一朵永生玫瑰 ","包装：精品礼盒装","花语：爱情只需要最简单最纯粹的方式---一朵七彩玫瑰就是一个好答案，你就是我唯一的色彩。","永生花礼盒-相爱相守","hy05-02.png","相爱相守","花材：进口七彩玫瑰 ","包装：精品礼盒装","花语：只有真心相爱相守的纯真的人才能培养出彩虹玫瑰，纯真发愿，点滴注入，璀璨绽放，笃定永恒。","初心-永生花礼盒","hy05-03.png","初心","花材：3朵厄瓜多尔进口永生花玫瑰，永生花绣球，永生花桑椹果。","包装：高档毛绒礼盒","花语：相识相知，最初的想法，便是珍惜，珍爱那份只要在视线内，就能感到满足，幸福的心。","姹紫嫣红－永生花礼盒","hy05-04.png","姹紫嫣红","花材：两朵白玫瑰，两朵紫玫瑰，两朵粉玫瑰，绣球搭配","包装：精品礼盒装","花语：随着时间的流逝激情不再，但是时光沉淀出的甜蜜也会让人不由自主的微笑。");

use flower;
CREATE TABLE flower_arcicle(
  id INT PRIMARY KEY AUTO_INCREMENT,
  content  VARCHAR(100)
);
INSERT INTO flower_arcicle VALUES(null,"朋友硕士毕业，应该送什么鲜花？");
INSERT INTO flower_arcicle VALUES(null,"和女朋友约会送什么花好？");
INSERT INTO flower_arcicle VALUES(null,"代表爱情的花都有哪些？");
INSERT INTO flower_arcicle VALUES(null,"毕业送什么花合适？");
INSERT INTO flower_arcicle VALUES(null,"扶郎花的花语是什么？");
INSERT INTO flower_arcicle VALUES(null,"庆祝企业周年庆典送什么花祝贺？");
INSERT INTO flower_arcicle VALUES(null,"代女同事过生日送什么花合适？");


